In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px

In [3]:
base_credit = pd.read_csv("../../../credit_data.csv")

# Localizando os clientes que estão cadastrados com a idade menor do que 0

In [4]:
base_credit.loc[base_credit['age'] < 0]

    clientid        income        age         loan  default
15        16  50501.726689 -28.218361  3977.287432        0
21        22  32197.620701 -52.423280  4244.057136        0
26        27  63287.038908 -36.496976  9595.286289        0

# 1. Apagar a coluna inteira

In [5]:
base_credit2 = base_credit.drop('age', axis = 1)
base_credit2

      clientid        income         loan  default
0            1  66155.925095  8106.532131        0
1            2  34415.153966  6564.745018        0
2            3  57317.170063  8020.953296        0
3            4  42709.534201  6103.642260        0
4            5  66952.688845  8770.099235        1
...        ...           ...          ...      ...
1995      1996  59221.044874  1926.729397        0
1996      1997  69516.127573  3503.176156        0
1997      1998  44311.449262  5522.786693        1
1998      1999  43756.056605  1622.722598        0
1999      2000  69436.579552  7378.833599        0

[2000 rows x 4 columns]

# 2. Apagar somente os registros com valores inconsistentes

In [7]:
base_credit3 = base_credit.drop(base_credit[base_credit['age'] < 0].index)
base_credit3

      clientid        income        age         loan  default
0            1  66155.925095  59.017015  8106.532131        0
1            2  34415.153966  48.117153  6564.745018        0
2            3  57317.170063  63.108049  8020.953296        0
3            4  42709.534201  45.751972  6103.642260        0
4            5  66952.688845  18.584336  8770.099235        1
...        ...           ...        ...          ...      ...
1995      1996  59221.044874  48.518179  1926.729397        0
1996      1997  69516.127573  23.162104  3503.176156        0
1997      1998  44311.449262  28.017167  5522.786693        1
1998      1999  43756.056605  63.971796  1622.722598        0
1999      2000  69436.579552  56.152617  7378.833599        0

[1997 rows x 5 columns]

# 3. Preencher os valor inconsistentes manualmente (RECOMENDAVEL)

# 4. Preecher com a média

### Descobrindo a média da coluna 'age'

In [8]:
base_credit['age'][base_credit['age'] > 0].mean()

40.92770044906149

### Substituir os dados com a idade negativa para 40.92 (média da tabela)

In [9]:
base_credit.loc[base_credit['age'] < 0, 'age'] = 40.92